/**
  **********************************  STM8S  ***********************************
  * @文件名     ： global_define.h
  * @作者       ： Huang Fugui
  * @库版本     ： V2.2.0
  * @文件版本   ： V1.0.1
  * @日期       ： 2014年12月22日
  * @摘要       ： 全局定义头文件
  ******************************************************************************/

/* 定义防止递归包含 ----------------------------------------------------------*/
#ifndef _GLOBAL_DEFINE_H
#define _GLOBAL_DEFINE_H


/* 包含的头文件 --------------------------------------------------------------*/
#include "stm8s.h"


/* 宏定义 --------------------------------------------------------------------*/
/* 标志位 */
#define FLAG_N_VALID              0xFF                     //标志无效
#define FLAG_VALID                'V'                      //标志有效

/* 接收标识 */
#define FLAG_CR                   0x0D                     //CR
#define FLAG_LF                   0x0A                     //LF


#endif /* _GLOBAL_DEFINE_H */

/***** Copyright (C)2014 HuangFugui. All Rights Reserved ***** END OF FILE *****/
